Repository: palomarl/74531705
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: Unless your masturbator or vibrator spent a few weeks in the core of a nuclear reactor, you don’t have to worry about getting cancer by masturbating.
es_es: A menos que tu masturbador o vibrador haya pasado unas semanas en el núcleo de un reactor nuclear, no tienes que preocuparte por contraer cáncer al masturbarte.

source: Unless you’ve examined it underneath a microscope, always assume your anal toy is dirty.
es_es: A menos que lo hayas examinado bajo un microscopio, asume siempre que tu juguete anal está sucio.

source: Use your other hand to start playing with your clit using the same circular motion.
es_es: Utiliza la otra mano para empezar a jugar con tu clítoris con el mismo movimiento circular.

source: Using Ben Wa Balls for Kegel Exercises
es_es: Uso de Bolas Ben Wa para ejercicios de Kegel.

source: Using Ben Wa Balls for Masturbation
es_es: Usar las Bolas Ben Wa para la masturbación

source: Using Your Forbidden Apple Clitoral Stimulator
es_es: Cómo usar tu estimulador de clítoris Forbidden Apple

source: Using strong cleaners or detergents can damage sex toys with delicate finishes.
es_es: Utilizar limpiadores o detergentes fuertes puede dañar los juguetes eróticos con acabados delicados.

source: Vary your stroking pace and grip to enhance your pleasure.
es_es: Varía el ritmo de las caricias y el agarre para aumentar el placer.

source: Vibrators also help you learn about your body to make having an orgasm easier in the future – even if you run out of batteries for your vibrator!
es_es: Los vibradores también te ayudan a aprender a conocer tu cuerpo para que te resulte más fácil tener un orgasmo en el futuro, ¡incluso si te quedas sin pilas en el vibrador!

source: Vibrators are especially beneficial for women who have problems reaching an orgasm.
es_es: Los vibradores son especialmente beneficiosos para las mujeres que tienen problemas para llegar al orgasmo.

source: Vibrators aren’t just for masturbation either.
es_es: Los vibradores tampoco sirven solo para la masturbación.

source: Vibrators today came in a wide range of shapes, sizes and strengths.
es_es: Hoy en día, los vibradores pueden tener una infinidad de formas, tamaños y potencias.

source: Vibrators, whether they’re rechargeable or use batteries, are pretty simple to clean.
es_es: Los vibradores, ya sean recargables o a pilas, son muy fáciles de limpiar.

source: Wait a few seconds and then moving it in a small stirring-like motion.
es_es: Espera unos segundos y luego muévelo con un pequeño movimiento de agitación.

source: Warm up with one single weighted ball trainer, or go right for the duo balls for an extra stimulating challenge.
es_es: Calienta con una sola bola lastrada o ve directamente a por el dúo de bolas para un desafío extra estimulante.

source: Wash it in warm, soapy water before spraying it with an antibacterial sex toy cleaner.
es_es: Lávalo con agua tibia y jabón antes de rociarlo con un limpiador de juguetes eróticos antibacteriano.

source: Wash the balls in warm, soapy water or spray them with a sanitizing toy cleaner.
es_es: Lava las pelotas con agua tibia y jabón o rocíalas con un limpiador de juguetes desinfectante.

source: Wash with mild soap & water.
es_es: Lavar con agua y jabón suave.

source: Wash with soap & water.
es_es: Lavar con agua y jabón.

source: Waterproof & submersible
es_es: Impermeable y sumergible

source: We can explore our erogenous zones, experiment with our human sexual response (such as how our desire, arousal, and orgasm work), and explore the playground of our imagination and fantasies.
es_es: Podemos explorar nuestras zonas erógenas, experimentar con nuestra respuesta sexual humana (como el funcionamiento del deseo, la excitación y el orgasmo) y explorar el campo de juego de nuestra imaginación y fantasías.

source: We carry several different types of cleaners for you to pick from.
es_es: Disponemos de varios tipos de limpiadores entre los que elegir

source: Weighted ABS plastic balls feel so firm and smooth
es_es: Bolas de plástico ABS lastradas de tacto firme y suave

source: Wet the tip of your finger with either saliva or lube.
es_es: Humedece la punta del dedo con saliva o lubricante.

source: What are Vibrators?
es_es: ¿Qué son los vibradores?

source: Whatever square you land on, you must perform the corresponding action.
es_es: Sea cual sea la casilla en la que caigas, deberás realizar la acción correspondiente.

source: When applying a coupon that exceeds that percentage, the discount taken will be automatically reduced to the maximum allowed amount.
es_es: Al aplicar un cupón que supere ese porcentaje, el descuento aplicado se reducirá automáticamente a la cantidad máxima permitida.

source: When cleaning sex toys, it’s really best to use a special sex toy cleaner.
es_es: Para limpiar los juguetes eróticos, lo mejor es utilizar un limpiador especial para juguetes eróticos.

source: When cleaning your stroker or masturbator, it’s best to flush the tunnel out first.
es_es: Cuando limpies tu masturbador, lo mejor es enjuagar primero el túnel.

source: When combined with regular Kegel exercises, Ben Wa Balls increase muscle control and dexterity for enhanced pleasure during sex as well as stronger orgasms.
es_es: Cuando se cominan con ejercicios de Kegel regularmente, las Bolas Ben Wa mejoran el control muscular y la destreza para más placer durante el sexo y también orgasmos más fuertes.

source: When done in moderate amounts, masturbation does not have harmful side effects.
es_es: Cuando se realiza en cantidades moderadas, la masturbación no tiene efectos secundarios perjudiciales.

source: When finished, simply hold the button down until the vibration stops.
es_es: Cuando hayas terminado, simplemente mantén pulsado el botón hasta que la vibración se detenga.

source: When most people hear the word vibrator, the first thing that comes to mind is a 5-inch piece of plastic that rattles around on a table or in a drawer while making a loud buzzing sound.
es_es: Cuando escuchamos la palabra vibrador, lo primero que se nos viene a la mente es una pieza de plástico de 12 centímetros que produce unos zumbidos muy fuertes en una mesa o dentro de un cajón.

source: When you're finished masturbating, turn the vibrating Kegel Balls off.
es_es: Cuando termines de masturbarte, apaga las bolas de Kegel vibratorias.

source: When you're finished using your Ben Wa Balls, you'll need to clean them.
es_es: Cuando termines de utilizar tus Bolas Ben Wa, tendrás que limpiarlas.

source: When you’re done, you can simply throw the condom away.
es_es: Cuando termines, puedes tirar el preservativo.

source: When you’re finished, hold the power button down for 3 seconds to turn it off.
es_es: Cuando hayas terminado, mantén pulsado el botón de encendido durante 3 segundos para apagarlo.

source: When you’re finished, simply press the power button again for 3 more seconds to turn it off.
es_es: Cuando hayas terminado, pulsa de nuevo el botón de encendido durante 3 segundos más para apagarlo.

source: When you’re getting the hang of it, you can trade up to the duo ball trainer.
es_es: Cuando le cojas el tranquillo, puedes cambiar al entrenador de pelotas dúo.

source: Whether you spank the monkey or rub the little man in the boat, this helpful guide delivers a detailed overview about everyone's favorite hands-on activity: masturbation.
es_es: Te hagas manuelas o riegues el monte de Venus, esta útil guía ofrece una descripción detallada sobre la actividad manual favorita de todo el mundo: la masturbación.

source: Whether you want to warm up during foreplay or just like getting naughty in public, this egg vibrator and remote control are made for you!
es_es: Tanto si quieres entrar en calor durante los preliminares como si te gusta ponerte cachonda en público, ¡este huevo vibrador y su mando a distancia están hechos para ti!

source: While many vibrators today are waterproof, very few remotes are.
es_es: Aunque hoy en día muchos vibradores son resistentes al agua, muy pocos mandos a distancia lo son.

source: While most people still use vibrators for masturbation, there are many other uses for vibrators.
es_es: Aunque la mayoría de la gente sigue utilizando los vibradores para masturbarse, existen muchos otros usos para los vibradores.

source: While the basic rules cover most types of sex toys, there are few out there — such as anal toys, strokers/masturbators, and realistic toys — that require some special care.
es_es: Aunque las normas básicas cubren la mayoría de los juguetes sexuales, hay algunos como los anales, los masturbadores y los realistas, que requieren un cuidado especial.

source: While these realistic materials really bring your sex toy to life, they do require some extra maintenance beyond the typical cleaning.
es_es: Si bien estos materiales realistas realmente dan vida a tu juguete sexual, requieren un mantenimiento adicional más allá de la limpieza típica.

source: While you do have to pay extra for the toy cleaners, many of them contain antibacterial agents, deodorizers and other beneficial features to help keep your favorite sex toys in tip-top shape.
es_es: Aunque hay que pagar un extra por los limpiadores de juguetes, muchos de ellos contienen agentes antibacterianos, desodorantes y otras características beneficiosas para ayudar a mantener tus juguetes sexuales favoritos en perfecto estado.

source: While you’re waiting, you can use corn starch as a short-term substitution.
es_es: Mientras esperas, puedes utilizar almidón de maíz como sustituto a corto plazo.

source: Wipe yourself clean before washing up with warm, soapy water.
es_es: Límpiate con un pañuelo antes de lavarte con agua tibia y jabón.

source: With frequent practice, you won’t even need the cream anymore!
es_es: Si lo practicas a menudo, ya no necesitarás la crema.

source: With its discreet design and user-friendly remote control, you can use the egg pretty much anywhere.
es_es: Con su discreto diseño y su mando a distancia de fácil uso, puedes utilizar el huevo prácticamente en cualquier lugar.

source: With its discreet design, you can hide it in plain sight.
es_es: Con su discreto diseño, podrás ocultarlo a plena vista.

source: With proper care and maintenance, your favorite sex toys can last for years.
es_es: Con los cuidados y el mantenimiento adecuados, tus juguetes eróticos favoritos pueden durar años.

source: With the egg’s extra-quiet motor, you could even use it in public while shopping in the grocery store or sitting through a meeting.
es_es: Con el motor extra silencioso del huevo, puede usarlo incluso en público mientras hace la compra en el supermercado o está sentado en una reunión.

source: Without further ado, Adam & Eve is proud to present Dr. Jenni Skyler's How to Masturbate Guide.
es_es: Sin más dilación, en Adam & Eve tenemos el honor de presentaros "La Guía de Cómo Masturbarse", de la doctora Jenni Skyler.

source: Women have used Ben Wa Balls to strengthen the Kegel muscles in their pelvic floor for centuries.
es_es: Las mujeres han usado las Bolas Ben Wa para ejercitar los músculos Kegel de su suelo pélvico durante siglos.

source: Works your clit, nipples & other sweet spots
es_es: Trabaja tu clítoris, pezones y otros puntos ideales

source: Wrap your hand snugly around the shaft.
es_es: Rodea el pene con la mano.

source: Yep, you read that right.
es_es: Sí, has leído bien.

source: Yes, masturbation is good for you.
es_es: Sí, la masturbación es buena para ti.

source: You can also find Ben Wa Balls with free-moving weights or built-in vibrators for stimulation during masturbation.
es_es: También se pueden encontrar Bolas Ben Wa con pesos libres o vibradores incorporados para la estimulación durante la masturbación.

source: You can also find out about the many benefits of masturbation as well as fun facts that you probably didn't know.
es_es: También puedes enterarte de los muchos beneficios de la masturbación y de datos curiosos que probablemente no sabías.

source: You can also try pulling the balls out and pressing them against your clit.
es_es: También puedes probar a sacar las bolas y presionarlas contra el clítoris.

source: You can also wear your kegel ball while moving around the house, or while stimulating yourself in other ways.
es_es: También puedes usar la pelota kegel mientras te mueves por casa o te estimulas de otras formas.

source: You can burn a lot more calories by jogging or running, which is why gyms use treadmills instead of vibrators.
es_es: Puedes quemar muchas más calorías haciendo footing o corriendo, por eso los gimnasios utilizan cintas de correr en lugar de vibradores.

source: You can even take Eve’s Ravishing Rose Pleaser with you into the tub or shower for underwater fun.
es_es: Incluso puedes llevarte el Ravishing Rose Pleaser de Eve a la bañera o a la ducha para divertirte bajo el agua.

source: You can experiment with multiple speeds, from relaxing all the way up to intense.
es_es: Puedes experimentar con varias velocidades, desde la más relajante hasta la más intensa.

source: You can find mini vibes the size of your fingernail and jumbo vibes the size of your arm.
es_es: Puedes encontrar mini vibradores del tamaño de tu uña y otros tan grandes como tu brazo.

source: You can keep the party in the bedroom, or even take these waterproof sex toys with you into the tub or shower.
es_es: Puedes mantener la fiesta en el dormitorio, o incluso llevarte estos juguetes sexuales impermeables a la bañera o la ducha.

source: You can remove the balls with their retrieval cord or finger loop when you're finished.
es_es: Puedes retirar las bolas con su cordón de recuperación o lazo para el dedo cuando hayas terminado.

source: You can turn the vibrations on and switch settings with the other button.
es_es: Puedes activar las vibraciones y cambiar los ajustes con el otro botón.

source: You can wear it around the house while you’re doing chores or watching TV.
es_es: Puedes llevarlo por toda la casa mientras haces las tareas domésticas o ves la televisión.

source: You know it's too much when you recognize your behaviors are out of control.
es_es: Sabes que es demasiado cuando reconoces que tus comportamientos están fuera de control.

source: You might also masturbate more often if you're not having sex with your partner as much as you'd like.
es_es: También podrías masturbarte más a menudo si no mantienes relaciones sexuales con tu pareja tanto como te gustaría.

source: You might even want to curl the tip of your finger to point to your belly button to tickle your G-Spot.
es_es: Incluso puedes doblar la punta del dedo señalando hacia el ombligo para hacerte cosquillas en el Punto G.

source: You should feel a slight tingle as the cream starts to work its magic.
es_es: Sentirás un ligero cosquilleo cuando la crema empiece a hacer efecto.

source: You should start noticing results within 6-12 weeks.
es_es: Deberías de empezar a ver resultados a las 6 o 12 semanas.

source: Younger people might masturbate multiple times a day, while others might be content with a few times a week or even a month.
es_es: Las personas más jóvenes pueden masturbarse varias veces al día, mientras que otras pueden conformarse con un par de veces a la semana o incluso al mes.

source: Your Cheat Sheet for Cleaning Sex Toys
es_es: Cómo limpiar los juguetes sexuales

source: Your body parts are made to be used, and bad things happen if they're not used.
es_es: Las partes de tu cuerpo están hechas para ser usadas, y si no se usan pasan cosas malas.

source: Your friends at Adam & Eve get dozens of questions every day about sex.
es_es: Tus amigos de Adam & Eve reciben cada día decenas de preguntas sobre sexo.

source: You’ll be amazed how good at getting you to the finish line those small puffs of air can be.
es_es: Te sorprenderá lo bien que te hacen llegar a la meta esas pequeñas bocanadas de aire.

source: You’ll be seeing stars in no time as this beauty works your G-Spot and kitty into a sexual frenzy!
es_es: Verás las estrellas en un abrir y cerrar de ojos cuando esta belleza haga que tu Punto G y tu gatito entren en un frenesí sexual.

source: You’ll still need to clean your anal toy, but the condom makes it much faster and easier.
es_es: Tendrás que seguir limpiando el juguete anal, pero el preservativo lo hace mucho más rápido y fácil.

source: You’re pretty sure you cleaned your toy after the last time you used it, and it looks clean when you take it out of the storage bag.
es_es: Estás bastante seguro de que limpiaste tu juguete después de la última vez que lo usaste, y parece limpio cuando lo sacas de la bolsa de almacenamiento.

source: “I was skeptical about whether this would actually make a difference, but it absolutely increases sensitivity." -Product Reviewer
es_es: "Era escéptico sobre si esto realmente haría una diferencia, pero absolutamente aumenta la sensibilidad." -Reseña del producto

source: • Cream comes in a 0.5 oz jar with screw top
es_es: - La crema se presenta en un tarro de 0,5 oz con tapón de rosca

source: • Hyper-stimulation makes it easier to have an orgasm
es_es: La hiperestimulación facilita el orgasmo

source: • Increases the sensitivity of your nerves
es_es: - Aumenta la sensibilidad de los nervios

source: • Jar contains enough cream for dozens of applications and even more orgasms
es_es: - El tarro contiene crema suficiente para docenas de aplicaciones y aún más orgasmos

source: • Makes even slight touches feel incredibly erotic and sensual
es_es: - Hace que incluso las caricias más leves resulten increíblemente eróticas y sensuales -

source: • Results may vary depending on a number of factors
es_es: - Los resultados pueden variar en función de diversos factores

source: • Use a small dab
es_es: - Utiliza una pequeña cantidad
